# Assigment Operater กำหนดค่า คือ เครื่องหมาย = 
# การทำงานของ  =  คือ เอาทางขวาไปใส่ทางซ้าย
# ยกเว้นแต่ว่า สิ่งที่อยู่ขวามื่อมีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
# ตัวแปร (vaiable ) = ข้อมูล (data)/นิพจน์(Expression)
# * ตัวแปร  (variable) คือ ชื่อที่ Dev. ตั้งชื่อขึ้นมาเองเพื่อใช้เก็บข้อมูล8 *
# * การใช้งานตัวแปร คือ เอาข้อมูลใส่ในตัวแปร หรือเอาข้อมูลที่มันเก็บอยู่มาใช้ *
score = 20
fullname = 'สมชาย'
salary = input('ป้อนเงินเดือน') 
sum = 20 + 30
print('---------------------')
num = 10
# ตัวกำหนดค่าอย่าย่อ
num += 10   # num = num +10
num -+ 10   # num = num -10
num *= 10   # num = num *2
num /= 10   # num = num /2
num %= 10   # num = num %2
num // 10   # num = num //2
print (num)
print('--------------------')