# คำสั่งรับข้อความ string ทางแป้นพิมพ์ใช้ฟังก์ชัน input() 
# ***** ตัวแปร variable คือชื่อที่ Dev ตั้งขึ้นมาเอง (ต้องเป็นไปตามกฎการตั้งชื่อ) เอาไว้เก็บข้อมูลที่เกิดขึ้นในโปรแกรม
# ฟังก์ชันแปลงข้อความเป็นตัวเลข

fullname = input('ป้อนชื่อ: ')
year_born = input('ป้อนปีเกิด พ.ศ: ')
print('----------------------------------------')
print( f'สวัสดีคุณ {fullname}')
print( f'คุณเกิดในปี {year_born} ตอนนี้คุณอายุ{2568 -int (year_born)}')
print('----------------------------------------')
#ใช้ ,
print('สวัสดีคุณ','fullname')
print('คุณเกิดในปี','year_born','ตอนนี้คุณอายุ'(2568 - int(year_born)))
print('----------------------------------------')
#ใช้ +
print('สวัสดีคุณ'+'fullname')
print('คุณเกิดในปี'+'year_born'+'ตอนนี้คุณอายุ'+ str(2568 - int(year_born))+'ปี')
print('----------------------------------------')
#ใช้ format
print('Hello {} คุณเกิดปี {} ตอนนี้คุณอายุ {} ปี'.format(fullname,year_born,2568 - int (year_born)))
print('----------------------------------------')